Repository: alex-rusakevich/shprote
Catalog: locale/*/LC_MESSAGES/*.po
Languages: be, ru

source: Hello there, {name}! I'm ready to check your pronunciation! 🤓
be: Добры дзень, {name}! Я гатовы праверыць вашы навыкі вымаўлення! 🤓
ru: Добрый день, {name}! Я готов к проверке вашего произношения! 🤓

source: 🎤 Check pronunciation
be: 🎤 Праверка вымаўлення
ru: 🎤 Проверка произношения

source: 👂 Check listening
be: 👂 Праверка аўдзіравання
ru: 👂 Проверка аудирования

source: 🍱 Menu
be: 🍱 Меню
ru: 🍱 Меню

source: Welcome to the main menu!
be: Вітаем вас у галоўным меню!
ru: Добро пожаловать в главное меню!

source: ❌ Stop
be: ❌ Запыніць
ru: ❌ Остановить

source: The check has been stopped. Getting back to the menu...
be: Праверка запынена. Вяртаемся у галоўнае меню...
ru: Проверка остановлена. Возвращаемся в главное меню...

source: ❓ Help
be: ❓ Дапамога
ru: ❓ Помощь

source: *Standardized 汉语 Pronunciation TEster {__version__}* Created by Alexander Rusakevich (https://github.com/alex-rusakevich) /start — start the bot and go to the main menu /help — display this message /checkpr — begin your pronunciation check. The special code / hash in bot replies is intended to avoid pupil cheating by sending different results or fake tasks /checklisten — begin the listening check /stop — stop the check and go to main menu _May 汉语 be with you!_ _Special thanks to the authors of {used_packages_exc_last} and {used_packages_last} libraries_
be: *Праграма праверкі кітайскага вымаўлення "shprote" {__version__}* Створана Аляксандрам Русакевічам (https://github.com/alex-rusakevich) /start — запусціць бота і перайсці ў галоўнае меню /help — паказаць даведку, якую вы зараз чытаеце /checkpr — пачаць праверку вымаўлення. Спецыяльны код / хэш у адказах выкарыстоўваецца дзеля таго, каб студэнт не мог паслаць розныя адказы і рэзультаты /checklisten — пачаць праверку аўдзіравання /stop — запыніць праверку і перайсці ў галоўнае меню _Няхай прыбудзе з вамі кітайская мова!_ _Асабліва дзякую аўтарам бібліятэк {used_packages_exc_last} і {used_packages_last}_
ru: *Программа проверки китайского произношения "shprote" {__version__}* Создано Александром Русакевичем (https://github.com/alex-rusakevich) /start — запустить бота и перейти в главное меню /help — показать справку, которую вы сейчас читаете /checkpr — начать проверку произношения. Специальный код / хэш в ответах бота используется для того, чтобы учащийся не смог послать разные ответы и результаты /checklisten — начать проверку аудирования /stop — остановить проверку и перейти в главное меню _Да прибудет с вами китайский!_ _Особая благодарность выражается авторам библиотек {used_packages_exc_last} и {used_packages_last}_

source: Checking your telegram id...
be: Правяраю ваш id у Тэлеграм...
ru: Проверяю ваш id в Телеграм...

source: 🔴 Shutdown
be: 🔴 Выключыць
ru: 🔴 Выключить

source: 📜 Log
be: 📜 Логі
ru: 📜 Логи

source: 🧮 Statistics
be: 🧮 Статыстыка
ru: 🧮 Статистика

source: 📣 Message to all users
be: 📣 Паведамленне ўсім карыстальнікам
ru: 📣 Сообщение всем пользователям

source: ✅ The id is correct. Now enter the password, please:
be: ✅ id быў пацверджаны. Зараз, калі ласка, напішыце пароль:
ru: ✅ id подтвержден. Теперь, пожалуйста, введите пароль:

source: ⛔ Your id is not allowed, returning to the main menu
be: ⛔ Ваш id не быў дапушчаны, вяртаюся ў галоўнае меню
ru: ⛔ Ваш id не был допущен, возвращаюсь в главное меню

source: Returning to the main menu
be: Вяртаюся ў галоўнае меню
ru: Возвращаюсь в главное меню

source: ⛔ The password is wrong, returning to the main menu
be: ⛔ Няправільны пароль, вяртаюся ў галоўнае меню
ru: ⛔ Неправильный пароль, возвращаюсь в главное меню

source: Hello, admin!
be: Добры дзень, адміністратар!
ru: Добрый день, администратор!

source: Switching back to the menu...
be: Вяртаюся ў галоўнае меню...
ru: Возвращаюсь в главное меню...

source: I do hope you know what you've done...
be: Спадзяваюся, вы ведаеце, што робіце...
ru: Надеюсь, вы знаете, что делаете...

source: Here you are...
be: Вось, трымайце...
ru: Вот, держите...

source: Done, no more logs left to send
be: Зроблена, усе логі былі адасланы
ru: Готово, все логи были отправлены

source: *All users:* {users_in_total} ({new_users_month} this month, {new_users_year} this year) *Active users this year:* {active_users_this_year} ({new_active_users_this_year}) *Active users this month:* {active_users_this_month} ({new_active_users_this_month})
be: *Усе карыстальнікі:* {users_in_total} ({new_users_month} у гэтым месяцы, {new_users_year} у гэтым годзе) *Актыўных карыстальнікаў у гэтым годзе:* {active_users_this_year} ({new_active_users_this_year}) *Актыўных карыстальнікаў у гэтым месяцы:* {active_users_this_month} ({new_active_users_this_month})
ru: *Все пользователи:* {users_in_total} ({new_users_month} в этом месяце, {new_users_year} в этом году) *Активных пользователей в этом году:* {active_users_this_year} ({new_active_users_this_year}) *Активных пользователей в этом месяце:* {active_users_this_month} ({new_active_users_this_month})

source: Write to ⚠ *all* ⚠ the registred users:
be: Напісаць ⚠ *усім* ⚠ карыстальнікам:
ru: Написать ⚠ *всем* ⚠ пользователям:

source: Getting back to the admin menu...
be: Вяртаюся ў галоўнае меню...
ru: Возвращаюсь в главное меню...

source: 🟢 Done! {msg_count} messages sent!
be: 🟢 Зроблена! Усяго {msg_count} паведамленняў(-е)!
ru: 🟢 Готово! Отправлено {msg_count} сообщения(-е)!

source: Choose your language, please:
be: Калі ласка, выберыце вашу мову:
ru: Пожалуйста, выберите ваш язык:

source: 🔴 There is no such language: {langname}
be: 🔴 Мова не падтрымліваецца: {langname}
ru: 🔴 Язык не поддерживается: {langname}

source: *Something went wrong* {err_name}: {err_msg}
be: *Штосьці здарылася* {err_name}: {err_msg}
ru: *Что-то пошло не так* {err_name}: {err_msg}

source: <b>Student → teacher:</b> {telebot_diff}
be: <b>Студэнт → настаўнік:</b> {telebot_diff}
ru: <b>Студент → преподаватель:</b> {telebot_diff}

source: <b>Your {test_type} check result is {perc}% ({phon_mistakes} phonematic mistake(s))</b> <i>Now you can forward all the messages with the special code to your teacher</i>{student_to_teacher} <b>Teacher's transcription:</b> {teacher_repr} <b>Student's transcription:</b> {student_repr}
be: <b>Ваш рэзультат праверкі на {test_type}: {perc}% (колькасць фанематычных памылак: {phon_mistakes})</b> <i>Зараз вы можаце паслаць усе паведамленні вашаму выкладчыку</i>{student_to_teacher} <b>Транскрыпцыя таго, што сказаў выкладчык:</b> {teacher_repr} <b>Транскрыпцыя таго, што сказаў студэнт:</b> {student_repr}
ru: <b>Ваш результат проверки на {test_type}: {perc}% (кол-во фонематических ошибок: {phon_mistakes})</b> <i>Теперь вы можете переслать все сообщения, помеченные специальным кодом, вашему преподавателю</i>{student_to_teacher} <b>Транскрипция сказанного преподавателем:</b> {teacher_repr} <b>Транскрипция сказанного студентом:</b> {student_repr}

source: The *listening* check has started. _Please, remember that you cannot use replied or forwarded messages as student's answers._ Check's special code is
be: Праверка *аўдзіравання* пачалася. _Калі ласка, памятайце, што вы не можаце карыстацца ў якасці адказу адасланымі паведамленнямі і адказамі на тыя паведамленні, што былі раней._ Спецыяльны код праверкі
ru: Проверка *аудирования* началась. _Пожалуйста, помните, что вы не можете использовать в качестве пересланные сообщения либо ответы на те сообщения, что выводились раньше._ Специальный код проверки

source: ❓ Enter or redirect teacher's text or voice message or reply to it _(redirect and reply have the highest priority of the messages you send)_:
be: ❓ Напішыце або перашліце тэкст або галасавое паведамленне выкладчыка альбо адкажыце на яго _(калі ў адказе на паведамленне будзе тэкст, то праграма прыме толькі змест паведамлення, якое пераслалі / на якое адказалі)_:
ru: ❓ Введите или перешлите текст или голосовое сообщение преподавателя или ответьте на него, если оно выводилось ранее _(если в ответе на сообщение будет текст, то принято будет только содержание пересланного/отвеченного сообщения)_:

source: *[FORWARDED FROM {usr_name}]*
be: *[БЫЛО ПЕРАСЛАНА АД {usr_name}]*
ru: *[ПЕРЕСЛАНО ОТ {usr_name}]*

source: *[REPLIED TO {usr_name}]*
be: *[АДКАЗ ДЛЯ КАРЫСТАЛЬНІКА {usr_name}]*
ru: *[ОТВЕТ ДЛЯ ПОЛЬЗОВАТЕЛЯ {usr_name}]*

source: *[DONE BY THE STUDENT]*
be: *[ЗРОБЛЕНА СТУДЭНТАМ]*
ru: *[СДЕЛАНО СТУДЕНТОМ]*

source: ⏳ Processing the audio file, please, wait...
be: ⏳ Файл з аўдыё апрацоўваецца, калі ласка, пачакайце...
ru: ⏳ Файл с аудио обрабатывается, пожалуйста, подождите...

source: 🔴 Cannot process this file, please, try another one:
be: 🔴 Файл немагчыма апрацаваць, калі ласка, паспрабуйце іншы:
ru: 🔴 Файл невозможно обработать, пожалуйста, попробуйте другой:

source: Teacher's signed voice message {forwarded_msg}
be: Галасавое паведамленне выкладчыка са спецыяльным кодам {forwarded_msg}
ru: Голосовое сообщение преподавателя со специальным кодом {forwarded_msg}

source: 🔴 Wrong data type ("{data_type}"), please, send a voice message or an audio (.mp3, .ogg) file:
be: 🔴 Няправільны тып даных ("{data_type}"), калі ласка, пашліце галасавое паведамленне або аўдыё (.mp3, .ogg) файл:
ru: 🔴 Неправильный тип данных ("{data_type}"), пожалуйста, пошлите голосовое сообщение или файл с аудио (.mp3, .ogg):

source: ❓ Student's answer:
be: ❓ Адказ студэнта:
ru: ❓ Ответ студента:

source: *The answer cannot be forwarded or be a reply. The test has been failed.*
be: *Вы не можаце карыстацца ў якасці адказу перасланымі альбо адказанымі паведамленнямі. Тэст быў правалены*
ru: *В качестве ответа не могут быть использованы пересланные или отвеченные сообщения. Тест был провален*

source: Student wrote: {student}
be: Студэнт напісаў: {student}
ru: Студент написал: {student}

source: 🔴 Wrong data type, please, send _text_:
be: 🔴 Няправільны тып даных, калі ласка, пашліце _тэкст_:
ru: 🔴 Неправильный тип данных, пожалуйста, отправьте _текст_:

source: Now wait a little...
be: Зараз трохі пачакайце...
ru: Теперь немного подождите...

source: listening
be: аўдзіраванне
ru: аудирование

source: The *pronunciation* check has started. _Please, remember that you cannot use replied or forwarded messages as student's answers._ Check's special code is
be: Праверка *вымаўлення* пачалася. _Калі ласка, памятайце, што вы не можаце карыстацца ў якасці адказу адасланымі паведамленнямі і адказамі на тыя паведамленні, што былі раней._ Спецыяльны код праверкі
ru: Проверка *произношения* началась. _Пожалуйста, помните, что вы не можете использовать в качестве пересланные сообщения либо ответы на те сообщения, что выводились раньше._ Специальный код проверки

source: Teacher wrote {forwarded_msg}: {teacher}
be: Выкладчык напісаў {forwarded_msg}: {teacher}
ru: Преподаватель написал {forwarded_msg}: {teacher}

source: Teacher said {forwarded_msg}: {teacher} *The signed voice message itself will appear below*
be: Настаўнік сказаў {forwarded_msg}: {teacher} *Падпісанае галасавое паведамленне з'явіцца ніжэй*
ru: Преподаватель сказал {forwarded_msg}: {teacher} *Сообщение с цифровой подписью появится ниже*

source: Teacher's signed voice message,
be: Падпісанае галасавое паведамленне выкладчыка,
ru: Голосовое сообщение преподавателя со специальным кодом,

source: ❓ Student's voice record:
be: ❓ Запіс голасу студэнта:
ru: ❓ Запись голоса студента:

source: Student said: {student} *The signed voice message will appear below*
be: Студеэнт сказаў: {student} *Падпісанае галасавое паведамленне з'явіцца ніжэй*
ru: Студент сказал: {student} *Сообщение с цифровой подписью появится ниже*

source: Student's signed voice message,
be: Падпісанае галасавое паведамленне студэнта,
ru: Голосовое сообщение студента со специальным кодом,

source: 🔴 Wrong data type ("{data_type}"), please, send a _voice_ message:
be: 🔴 Няправільны тып даных ("{data_type}"), калі ласка, пашліце _галасавое паведамленне_:
ru: 🔴 Неправильный тип данных ("{data_type}"), пожалуйста, отправьте _голосовое сообщение_:

source: pronunciation
be: вымаўленне
ru: произношение
